MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0E2093CFM/mcu.h
/* =========================================================================================================================== */
/* ================                                         R_UARTA0                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Serial Interface UARTA (R_UARTA0)
 */

typedef struct                         /*!< (@ 0x400A3400) R_UARTA0 Structure                                         */
{
    __IOM uint8_t TXBAn;               /*!< (@ 0x00000000) Transmit Buffer Register 0                                 */
    __IM uint8_t  RXBAn;               /*!< (@ 0x00000001) Receive Buffer Register 0                                  */

    union
    {
        __IOM uint8_t ASIMAn0;         /*!< (@ 0x00000002) Operation Mode Setting Register 00                         */

        struct
        {
            __IOM uint8_t ISRMA : 1;   /*!< [0..0] Receive Interrupt Mode Select                                      */
            __IOM uint8_t ISSMA : 1;   /*!< [1..1] Transmit Interrupt Mode Select                                     */
            uint8_t             : 3;
            __IOM uint8_t RXEA  : 1;   /*!< [5..5] Reception Enable                                                   */
            __IOM uint8_t TXEA  : 1;   /*!< [6..6] Transmission Enable                                                */
            __IOM uint8_t EN    : 1;   /*!< [7..7] UART Operation Enable                                              */
        } ASIMAn0_b;
    };

    union
    {
        __IOM uint8_t ASIMAn1;         /*!< (@ 0x00000003) Operation Mode Setting Register 01                         */

        struct
        {
            __IOM uint8_t ALV : 1;     /*!< [0..0] Transmission and Reception Level Setting                           */
            __IOM uint8_t DIR : 1;     /*!< [1..1] Transmission and Reception Order Setting                           */
            __IOM uint8_t SL  : 1;     /*!< [2..2] Transmission Stop Bit Length Setting                               */
            __IOM uint8_t CL  : 2;     /*!< [4..3] Transmission and Reception Character Length Setting                */
            __IOM uint8_t PS  : 2;     /*!< [6..5] Transmission and Reception Parity Bit Setting                      */
            uint8_t           : 1;
        } ASIMAn1_b;
    };
    __IOM uint8_t BRGCAn;              /*!< (@ 0x00000004) Baud Rate Generator Control Register 0                     */

    union
    {
        __IM uint8_t ASISAn;           /*!< (@ 0x00000005) Status Register 0                                          */

        struct
        {
            __IM uint8_t OVEA  : 1;    /*!< [0..0] Overrun Error Flag                                                 */
            __IM uint8_t FEA   : 1;    /*!< [1..1] Framing Error Flag                                                 */
            __IM uint8_t PEA   : 1;    /*!< [2..2] Parity Error Flag                                                  */
            uint8_t            : 1;
            __IM uint8_t TXSFA : 1;    /*!< [4..4] Transmit Shift Register Data Flag                                  */
            __IM uint8_t TXBFA : 1;    /*!< [5..5] Transmit Buffer Data Flag                                          */
            uint8_t            : 2;
        } ASISAn_b;
    };

    union
    {
        __IOM uint8_t ASCTAn;          /*!< (@ 0x00000006) Status Clear Trigger Register 0                            */

        struct
        {
            __IOM uint8_t OVECTA : 1;  /*!< [0..0] Overrun Error Flag Clear Trigger                                   */
            __IOM uint8_t FECTA  : 1;  /*!< [1..1] Framing Error Flag Clear Trigger                                   */
            __IOM uint8_t PECTA  : 1;  /*!< [2..2] Parity Error Flag Clear Trigger                                    */
            uint8_t              : 5;
        } ASCTAn_b;
    };
} R_UARTA0_Type;                       /*!< Size = 7 (0x7)                                                            */

/* =========================================================================================================================== */
/* ================                                        R_UARTA_CK                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief Serial Interface UARTA Clock (R_UARTA_CK)
 */

typedef struct                         /*!< (@ 0x400A3500) R_UARTA_CK Structure                                       */
{
    union
    {
        __IOM uint8_t UTAnCK[2];       /*!< (@ 0x00000000) UARTA Clock Select Register                                */

        struct
        {
            __IOM uint8_t CK  : 4;     /*!< [3..0] UARTAn Operation Clock Select (fUTAn)                              */
            __IOM uint8_t SEL : 2;     /*!< [5..4] fSEL Clock Select                                                  */
            uint8_t           : 1;
            __IOM uint8_t EN  : 1;     /*!< [7..7] UARTAn clock output function enable                                */
        } UTAnCK_b[2];
    };
} R_UARTA_CK_Type;                     /*!< Size = 2 (0x2)                                                            */

/* =========================================================================================================================== */
/* ================                                          R_RTC_C                                          ================ */
/* =========================================================================================================================== */

/**
 * @brief Real Time Clock (R_RTC_C)
 */

typedef struct                         /*!< (@ 0x400A2C00) R_RTC_C Structure                                          */
{
    union
    {
        __IOM uint8_t SEC;             /*!< (@ 0x00000000) Second Count Register                                      */

        struct
        {
            __IOM uint8_t SEC1  : 4;   /*!< [3..0] 1-second count                                                     */
            __IOM uint8_t SEC10 : 3;   /*!< [6..4] 10-second count                                                    */
            uint8_t             : 1;
        } SEC_b;
    };

    union
    {
        __IOM uint8_t MIN;             /*!< (@ 0x00000001) Minute Count Register                                      */

        struct
        {
            __IOM uint8_t MIN1  : 4;   /*!< [3..0] 1-minute count                                                     */
            __IOM uint8_t MIN10 : 3;   /*!< [6..4] 10- minute count                                                   */
            uint8_t             : 1;
        } MIN_b;
    };

    union
    {
        __IOM uint8_t HOUR;            /*!< (@ 0x00000002) Hour Count Register                                        */

        struct
        {
            __IOM uint8_t HOUR1  : 4;  /*!< [3..0] 1-hour count                                                       */
            __IOM uint8_t HOUR10 : 2;  /*!< [5..4] 10-hour count                                                      */
            uint8_t              : 2;
        } HOUR_b;
    };

    union
    {
        __IOM uint8_t WEEK;            /*!< (@ 0x00000003) Day-of-Week Count Register                                 */

        struct
        {
            __IOM uint8_t WEEK : 3;    /*!< [2..0] Day-of-Week Counting                                               */
            uint8_t            : 5;
        } WEEK_b;
    };

    union
    {
        __IOM uint8_t DAY;             /*!< (@ 0x00000004) Day Count Register                                         */

        struct
        {
            __IOM uint8_t DAY1  : 4;   /*!< [3..0] 1-day count                                                        */
            __IOM uint8_t DAY10 : 2;   /*!< [5..4] 10-day count                                                       */
            uint8_t             : 2;
        } DAY_b;
    };

    union
    {
        __IOM uint8_t MONTH;           /*!< (@ 0x00000005) Month Count Register                                       */

        struct
        {
            __IOM uint8_t MONTH1  : 4; /*!< [3..0] 1-month count                                                      */
            __IOM uint8_t MONTH10 : 1; /*!< [4..4] 10-month count                                                     */
            uint8_t               : 3;
        } MONTH_b;
    };

    union
    {
        __IOM uint8_t YEAR;            /*!< (@ 0x00000006) Year Count Register                                        */

        struct
        {
            __IOM uint8_t YEAR1  : 4;  /*!< [3..0] 1-year count                                                       */
            __IOM uint8_t YEAR10 : 4;  /*!< [7..4] 10-year count                                                      */
        } YEAR_b;
    };

    union
    {
        __IOM uint8_t SUBCUD;          /*!< (@ 0x00000007) Time Error Correction Register                             */

        struct
        {
            __IOM uint8_t F   : 6;     /*!< [5..0] Adjustment Value                                                   */
            __IOM uint8_t F6  : 1;     /*!< [6..6] Setting of time error correction value                             */
            __IOM uint8_t DEV : 1;     /*!< [7..7] Setting of time error correction timing                            */
        } SUBCUD_b;
    };

    union
    {
        __IOM uint8_t ALARMWM;         /*!< (@ 0x00000008) Alarm Minute Register                                      */

        struct
        {
            __IOM uint8_t WM1  : 4;    /*!< [3..0] 1-digit minute setting                                             */
            __IOM uint8_t WM10 : 3;    /*!< [6..4] 10-digit minute setting                                            */
            uint8_t            : 1;
        } ALARMWM_b;
    };

    union
    {
        __IOM uint8_t ALARMWH;         /*!< (@ 0x00000009) Alarm Hour Register                                        */

        struct
        {
            __IOM uint8_t WH1  : 4;    /*!< [3..0] 1-digit hour setting                                               */
            __IOM uint8_t WH10 : 2;    /*!< [5..4] 10-digit hour setting                                              */
            uint8_t            : 2;
        } ALARMWH_b;
    };

    union
    {
        __IOM uint8_t ALARMWW;         /*!< (@ 0x0000000A) Alarm Day-of-Week Register                                 */

        struct
        {
            __IOM uint8_t WW0 : 1;     /*!< [0..0] Alarm enabled setting 'Sunday'                                     */
            __IOM uint8_t WW1 : 1;     /*!< [1..1] Alarm enabled setting 'Monday'                                     */
            __IOM uint8_t WW2 : 1;     /*!< [2..2] Alarm enabled setting 'Tuesday'                                    */
            __IOM uint8_t WW3 : 1;     /*!< [3..3] Alarm enabled setting 'Wednesday'                                  */
            __IOM uint8_t WW4 : 1;     /*!< [4..4] Alarm enabled setting 'Thursday'                                   */
            __IOM uint8_t WW5 : 1;     /*!< [5..5] Alarm enabled setting 'Friday'                                     */
            __IOM uint8_t WW6 : 1;     /*!< [6..6] Alarm enabled setting 'Saturday'                                   */
            uint8_t           : 1;
        } ALARMWW_b;
    };

    union
    {
        __IOM uint8_t RTCC0;            /*!< (@ 0x0000000B) Realtime Clock Control Register 0                          */

        struct
        {
            __IOM uint8_t CT       : 3; /*!< [2..0] Fixed-cycle interrupt (RTC_ALM_OR_PRD) selection                   */
            __IOM uint8_t AMPM     : 1; /*!< [3..3] Selection of 12- or 24-hour system                                 */
            __IOM uint8_t RTC128EN : 1; /*!< [4..4] Selection of the operating clock for the realtime clock
                                         *   (RTCCLK)                                                                  */
            __IOM uint8_t RCLOE1 : 1;   /*!< [5..5] RTCOUT pin output control                                          */
            uint8_t              : 1;
            __IOM uint8_t RTCE   : 1;   /*!< [7..7] Realtime clock operation control                                   */
        } RTCC0_b;
    };

    union
    {
        __IOM uint8_t RTCC1;           /*!< (@ 0x0000000C) Realtime Clock Control Register 1                          */

        struct
        {
            __IOM uint8_t RWAIT : 1;   /*!< [0..0] Wait control of realtime clock                                     */
            __IM uint8_t  RWST  : 1;   /*!< [1..1] Wait status flag of realtime clock                                 */
            uint8_t             : 1;
            __IOM uint8_t RIFG  : 1;   /*!< [3..3] Fixed-cycle interrupt status flag                                  */
            __IOM uint8_t WAFG  : 1;   /*!< [4..4] Alarm detection status flag                                        */
            uint8_t             : 1;
            __IOM uint8_t WALIE : 1;   /*!< [6..6] Control of alarm interrupt (RTC_ALM_OR_PRD)                        */
            __IOM uint8_t WALE  : 1;   /*!< [7..7] Alarm operation control                                            */
        } RTCC1_b;
    };
} R_RTC_C_Type;                        /*!< Size = 13 (0xd)                                                           */

