MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0E2093CFM/mcu.h
/* ==========================================================  ADD  ========================================================== */
 #define R_BUS_BMSAERR_ADD_MSERAD_Pos      (0UL)          /*!< MSERAD (Bit 0)                                        */
 #define R_BUS_BMSAERR_ADD_MSERAD_Msk      (0xffffffffUL) /*!< MSERAD (Bitfield-Mask: 0xffffffff)                    */
/* ==========================================================  RW  =========================================================== */
 #define R_BUS_BMSAERR_RW_MSARWSTAT_Pos    (0UL)          /*!< MSARWSTAT (Bit 0)                                     */
 #define R_BUS_BMSAERR_RW_MSARWSTAT_Msk    (0x1UL)        /*!< MSARWSTAT (Bitfield-Mask: 0x01)                       */

/* =========================================================================================================================== */
/* ================                                            OAD                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  BUSOAD  ========================================================= */
 #define R_BUS_OAD_BUSOAD_BWERROAD_Pos     (2UL)      /*!< BWERROAD (Bit 2)                                      */
 #define R_BUS_OAD_BUSOAD_BWERROAD_Msk     (0x4UL)    /*!< BWERROAD (Bitfield-Mask: 0x01)                        */
 #define R_BUS_OAD_BUSOAD_SLERROAD_Pos     (1UL)      /*!< SLERROAD (Bit 1)                                      */
 #define R_BUS_OAD_BUSOAD_SLERROAD_Msk     (0x2UL)    /*!< SLERROAD (Bitfield-Mask: 0x01)                        */
 #define R_BUS_OAD_BUSOAD_ILERROAD_Pos     (0UL)      /*!< ILERROAD (Bit 0)                                      */
 #define R_BUS_OAD_BUSOAD_ILERROAD_Msk     (0x1UL)    /*!< ILERROAD (Bitfield-Mask: 0x01)                        */
/* =======================================================  BUSOADPT  ======================================================== */
 #define R_BUS_OAD_BUSOADPT_KEY_Pos        (8UL)      /*!< KEY (Bit 8)                                           */
 #define R_BUS_OAD_BUSOADPT_KEY_Msk        (0xff00UL) /*!< KEY (Bitfield-Mask: 0xff)                             */
 #define R_BUS_OAD_BUSOADPT_PROTECT_Pos    (0UL)      /*!< PROTECT (Bit 0)                                       */
 #define R_BUS_OAD_BUSOADPT_PROTECT_Msk    (0x1UL)    /*!< PROTECT (Bitfield-Mask: 0x01)                         */
/* ========================================================  MSAOAD  ========================================================= */
 #define R_BUS_OAD_MSAOAD_KEY_Pos          (8UL)      /*!< KEY (Bit 8)                                           */
 #define R_BUS_OAD_MSAOAD_KEY_Msk          (0xff00UL) /*!< KEY (Bitfield-Mask: 0xff)                             */
 #define R_BUS_OAD_MSAOAD_OAD_Pos          (0UL)      /*!< OAD (Bit 0)                                           */
 #define R_BUS_OAD_MSAOAD_OAD_Msk          (0x1UL)    /*!< OAD (Bitfield-Mask: 0x01)                             */
/* =========================================================  MSAPT  ========================================================= */
 #define R_BUS_OAD_MSAPT_KEY_Pos           (8UL)      /*!< KEY (Bit 8)                                           */
 #define R_BUS_OAD_MSAPT_KEY_Msk           (0xff00UL) /*!< KEY (Bitfield-Mask: 0xff)                             */
 #define R_BUS_OAD_MSAPT_PROTECT_Pos       (0UL)      /*!< PROTECT (Bit 0)                                       */
 #define R_BUS_OAD_MSAPT_PROTECT_Msk       (0x1UL)    /*!< PROTECT (Bitfield-Mask: 0x01)                         */

/* =========================================================================================================================== */
/* ================                                          MBWERR                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  STAT  ========================================================== */
 #define R_BUS_MBWERR_STAT_BWERR_Pos    (0UL)   /*!< BWERR (Bit 0)                                         */
 #define R_BUS_MBWERR_STAT_BWERR_Msk    (0x1UL) /*!< BWERR (Bitfield-Mask: 0x01)                           */
/* ==========================================================  CLR  ========================================================== */
 #define R_BUS_MBWERR_CLR_BWERR_Pos     (0UL)   /*!< BWERR (Bit 0)                                         */
 #define R_BUS_MBWERR_CLR_BWERR_Msk     (0x1UL) /*!< BWERR (Bitfield-Mask: 0x01)                           */

/* =========================================================================================================================== */
/* ================                                           BUSM                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CNT  ========================================================== */
 #define R_BUS_BUSM_CNT_IERES_Pos    (15UL)     /*!< IERES (Bit 15)                                        */
 #define R_BUS_BUSM_CNT_IERES_Msk    (0x8000UL) /*!< IERES (Bitfield-Mask: 0x01)                           */

/* =========================================================================================================================== */
/* ================                                           BUSS                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  CNT  ========================================================== */
 #define R_BUS_BUSS_CNT_ARBMET_Pos    (4UL)    /*!< ARBMET (Bit 4)                                        */
 #define R_BUS_BUSS_CNT_ARBMET_Msk    (0x30UL) /*!< ARBMET (Bitfield-Mask: 0x03)                          */
 #define R_BUS_BUSS_CNT_ARBS_Pos      (0UL)    /*!< ARBS (Bit 0)                                          */
 #define R_BUS_BUSS_CNT_ARBS_Msk      (0x3UL)  /*!< ARBS (Bitfield-Mask: 0x03)                            */

/* =========================================================================================================================== */
/* ================                                          ELSEGR                                           ================ */
/* =========================================================================================================================== */

/* ==========================================================  BY  =========================================================== */
 #define R_ELC_ELSEGR_BY_WI_Pos     (7UL)    /*!< WI (Bit 7)                                            */
 #define R_ELC_ELSEGR_BY_WI_Msk     (0x80UL) /*!< WI (Bitfield-Mask: 0x01)                              */
 #define R_ELC_ELSEGR_BY_WE_Pos     (6UL)    /*!< WE (Bit 6)                                            */
 #define R_ELC_ELSEGR_BY_WE_Msk     (0x40UL) /*!< WE (Bitfield-Mask: 0x01)                              */
 #define R_ELC_ELSEGR_BY_SEG_Pos    (0UL)    /*!< SEG (Bit 0)                                           */
 #define R_ELC_ELSEGR_BY_SEG_Msk    (0x1UL)  /*!< SEG (Bitfield-Mask: 0x01)                             */

/* =========================================================================================================================== */
/* ================                                           ELSR                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  HA  =========================================================== */
 #define R_ELC_ELSR_HA_ELS_Pos    (0UL)     /*!< ELS (Bit 0)                                           */
 #define R_ELC_ELSR_HA_ELS_Msk    (0x1ffUL) /*!< ELS (Bitfield-Mask: 0x1ff)                            */

/* =========================================================================================================================== */
/* ================                                            PIN                                            ================ */
/* =========================================================================================================================== */

/* ========================================================  PmnPFS  ========================================================= */
 #define R_PFS_PORT_PIN_PmnPFS_PODR_Pos     (0UL)      /*!< PODR (Bit 0)                                          */
 #define R_PFS_PORT_PIN_PmnPFS_PODR_Msk     (0x1UL)    /*!< PODR (Bitfield-Mask: 0x01)                            */
 #define R_PFS_PORT_PIN_PmnPFS_PIDR_Pos     (1UL)      /*!< PIDR (Bit 1)                                          */
 #define R_PFS_PORT_PIN_PmnPFS_PIDR_Msk     (0x2UL)    /*!< PIDR (Bitfield-Mask: 0x01)                            */
 #define R_PFS_PORT_PIN_PmnPFS_PDR_Pos      (2UL)      /*!< PDR (Bit 2)                                           */
 #define R_PFS_PORT_PIN_PmnPFS_PDR_Msk      (0x4UL)    /*!< PDR (Bitfield-Mask: 0x01)                             */
 #define R_PFS_PORT_PIN_PmnPFS_PSEL_Pos     (8UL)      /*!< PSEL (Bit 8)                                          */
 #define R_PFS_PORT_PIN_PmnPFS_PSEL_Msk     (0xf00UL)  /*!< PSEL (Bitfield-Mask: 0x0f)                            */
 #define R_PFS_PORT_PIN_PmnPFS_ISEL_Pos     (14UL)     /*!< ISEL (Bit 14)                                         */
 #define R_PFS_PORT_PIN_PmnPFS_ISEL_Msk     (0x4000UL) /*!< ISEL (Bitfield-Mask: 0x01)                            */
 #define R_PFS_PORT_PIN_PmnPFS_PMC_Pos      (15UL)     /*!< PMC (Bit 15)                                          */
 #define R_PFS_PORT_PIN_PmnPFS_PMC_Msk      (0x8000UL) /*!< PMC (Bitfield-Mask: 0x01)                             */
 #define R_PFS_PORT_PIN_PmnPFS_PCR_Pos      (4UL)      /*!< PCR (Bit 4)                                           */
 #define R_PFS_PORT_PIN_PmnPFS_PCR_Msk      (0x10UL)   /*!< PCR (Bitfield-Mask: 0x01)                             */
 #define R_PFS_PORT_PIN_PmnPFS_PIM_Pos      (5UL)      /*!< PIM (Bit 5)                                           */
 #define R_PFS_PORT_PIN_PmnPFS_PIM_Msk      (0x20UL)   /*!< PIM (Bitfield-Mask: 0x01)                             */
 #define R_PFS_PORT_PIN_PmnPFS_NCODR_Pos    (6UL)      /*!< NCODR (Bit 6)                                         */
 #define R_PFS_PORT_PIN_PmnPFS_NCODR_Msk    (0x40UL)   /*!< NCODR (Bitfield-Mask: 0x01)                           */

/* =========================================================================================================================== */
/* ================                                           PORT                                            ================ */
/* =========================================================================================================================== */

/* =========================================================================================================================== */
/* ================                                           TDR0                                            ================ */
/* =========================================================================================================================== */

/* =========================================================  TDR0n  ========================================================= */
/* ========================================================  TDR0nL  ========================================================= */
/* ========================================================  TDR0nH  ========================================================= */

/** @} */ /* End of group PosMask_clusters */

/* =========================================================================================================================== */
/* ================                                Pos/Mask Peripheral Section                                ================ */
/* =========================================================================================================================== */

/** @addtogroup PosMask_peripherals
 * @{
 */

/* =========================================================================================================================== */
/* ================                                          R_ADC_D                                          ================ */
/* =========================================================================================================================== */

/* =========================================================  ADM0  ========================================================== */
 #define R_ADC_D_ADM0_ADCE_Pos      (0UL)      /*!< ADCE (Bit 0)                                          */
 #define R_ADC_D_ADM0_ADCE_Msk      (0x1UL)    /*!< ADCE (Bitfield-Mask: 0x01)                            */
 #define R_ADC_D_ADM0_LV_Pos        (1UL)      /*!< LV (Bit 1)                                            */
 #define R_ADC_D_ADM0_LV_Msk        (0x6UL)    /*!< LV (Bitfield-Mask: 0x03)                              */
 #define R_ADC_D_ADM0_FR_Pos        (3UL)      /*!< FR (Bit 3)                                            */
 #define R_ADC_D_ADM0_FR_Msk        (0x38UL)   /*!< FR (Bitfield-Mask: 0x07)                              */
 #define R_ADC_D_ADM0_ADMD_Pos      (6UL)      /*!< ADMD (Bit 6)                                          */
 #define R_ADC_D_ADM0_ADMD_Msk      (0x40UL)   /*!< ADMD (Bitfield-Mask: 0x01)                            */
 #define R_ADC_D_ADM0_ADCS_Pos      (7UL)      /*!< ADCS (Bit 7)                                          */
 #define R_ADC_D_ADM0_ADCS_Msk      (0x80UL)   /*!< ADCS (Bitfield-Mask: 0x01)                            */
/* ==========================================================  ADS  ========================================================== */
 #define R_ADC_D_ADS_ADS_Pos        (0UL)      /*!< ADS (Bit 0)                                           */
 #define R_ADC_D_ADS_ADS_Msk        (0x1fUL)   /*!< ADS (Bitfield-Mask: 0x1f)                             */
 #define R_ADC_D_ADS_ADISS_Pos      (7UL)      /*!< ADISS (Bit 7)                                         */
 #define R_ADC_D_ADS_ADISS_Msk      (0x80UL)   /*!< ADISS (Bitfield-Mask: 0x01)                           */
/* =========================================================  ADM1  ========================================================== */
 #define R_ADC_D_ADM1_ADTRS_Pos     (0UL)      /*!< ADTRS (Bit 0)                                         */
 #define R_ADC_D_ADM1_ADTRS_Msk     (0x7UL)    /*!< ADTRS (Bitfield-Mask: 0x07)                           */
 #define R_ADC_D_ADM1_ADLSP_Pos     (3UL)      /*!< ADLSP (Bit 3)                                         */
 #define R_ADC_D_ADM1_ADLSP_Msk     (0x8UL)    /*!< ADLSP (Bitfield-Mask: 0x01)                           */
 #define R_ADC_D_ADM1_ADSCM_Pos     (5UL)      /*!< ADSCM (Bit 5)                                         */
 #define R_ADC_D_ADM1_ADSCM_Msk     (0x20UL)   /*!< ADSCM (Bitfield-Mask: 0x01)                           */
 #define R_ADC_D_ADM1_ADTMD_Pos     (6UL)      /*!< ADTMD (Bit 6)                                         */
 #define R_ADC_D_ADM1_ADTMD_Msk     (0xc0UL)   /*!< ADTMD (Bitfield-Mask: 0x03)                           */
/* =========================================================  ADM2  ========================================================== */
 #define R_ADC_D_ADM2_ADTYP_Pos     (0UL)      /*!< ADTYP (Bit 0)                                         */
 #define R_ADC_D_ADM2_ADTYP_Msk     (0x3UL)    /*!< ADTYP (Bitfield-Mask: 0x03)                           */
 #define R_ADC_D_ADM2_AWC_Pos       (2UL)      /*!< AWC (Bit 2)                                           */
 #define R_ADC_D_ADM2_AWC_Msk       (0x4UL)    /*!< AWC (Bitfield-Mask: 0x01)                             */
 #define R_ADC_D_ADM2_ADRCK_Pos     (3UL)      /*!< ADRCK (Bit 3)                                         */
 #define R_ADC_D_ADM2_ADRCK_Msk     (0x8UL)    /*!< ADRCK (Bitfield-Mask: 0x01)                           */
 #define R_ADC_D_ADM2_ADREFM_Pos    (5UL)      /*!< ADREFM (Bit 5)                                        */
 #define R_ADC_D_ADM2_ADREFM_Msk    (0x20UL)   /*!< ADREFM (Bitfield-Mask: 0x01)                          */
 #define R_ADC_D_ADM2_ADREFP_Pos    (6UL)      /*!< ADREFP (Bit 6)                                        */
 #define R_ADC_D_ADM2_ADREFP_Msk    (0xc0UL)   /*!< ADREFP (Bitfield-Mask: 0x03)                          */
/* =========================================================  ADUL  ========================================================== */
/* =========================================================  ADLL  ========================================================== */
/* =========================================================  ADTES  ========================================================= */
 #define R_ADC_D_ADTES_ADTES_Pos    (0UL)      /*!< ADTES (Bit 0)                                         */
 #define R_ADC_D_ADTES_ADTES_Msk    (0x3UL)    /*!< ADTES (Bitfield-Mask: 0x03)                           */
/* =========================================================  ADCR  ========================================================== */
 #define R_ADC_D_ADCR_ADCRH_Pos     (8UL)      /*!< ADCRH (Bit 8)                                         */
 #define R_ADC_D_ADCR_ADCRH_Msk     (0xff00UL) /*!< ADCRH (Bitfield-Mask: 0xff)                           */

/* =========================================================================================================================== */
/* ================                                           R_BUS                                           ================ */
/* =========================================================================================================================== */

/* ========================================================  CSRECEN  ======================================================== */
 #define R_BUS_CSRECEN_RCVENM_Pos        (8UL)       /*!< RCVENM (Bit 8)                                        */
 #define R_BUS_CSRECEN_RCVENM_Msk        (0x100UL)   /*!< RCVENM (Bitfield-Mask: 0x01)                          */
 #define R_BUS_CSRECEN_RCVEN_Pos         (0UL)       /*!< RCVEN (Bit 0)                                         */
 #define R_BUS_CSRECEN_RCVEN_Msk         (0x1UL)     /*!< RCVEN (Bitfield-Mask: 0x01)                           */
/* ========================================================  BUSMABT  ======================================================== */
 #define R_BUS_BUSMABT_ARBS_Pos          (0UL)       /*!< ARBS (Bit 0)                                          */
 #define R_BUS_BUSMABT_ARBS_Msk          (0x1UL)     /*!< ARBS (Bitfield-Mask: 0x01)                            */
/* =======================================================  BUSDIVBYP  ======================================================= */
 #define R_BUS_BUSDIVBYP_CPU0SBPE_Pos    (16UL)      /*!< CPU0SBPE (Bit 16)                                     */
 #define R_BUS_BUSDIVBYP_CPU0SBPE_Msk    (0x10000UL) /*!< CPU0SBPE (Bitfield-Mask: 0x01)                        */
 #define R_BUS_BUSDIVBYP_GDSSBPE_Pos     (3UL)       /*!< GDSSBPE (Bit 3)                                       */
 #define R_BUS_BUSDIVBYP_GDSSBPE_Msk     (0x8UL)     /*!< GDSSBPE (Bitfield-Mask: 0x01)                         */
 #define R_BUS_BUSDIVBYP_EDMABPE_Pos     (0UL)       /*!< EDMABPE (Bit 0)                                       */
 #define R_BUS_BUSDIVBYP_EDMABPE_Msk     (0x1UL)     /*!< EDMABPE (Bitfield-Mask: 0x01)                         */
/* =======================================================  BUSTHRPUT  ======================================================= */
 #define R_BUS_BUSTHRPUT_DIS_Pos         (0UL)       /*!< DIS (Bit 0)                                           */
 #define R_BUS_BUSTHRPUT_DIS_Msk         (0x1UL)     /*!< DIS (Bitfield-Mask: 0x01)                             */

/* =========================================================================================================================== */
/* ================                                           R_CRC                                           ================ */
/* =========================================================================================================================== */

