MikroElektronika/core_packages/ARM/gcc_clang/def/renesas/R7FA0E2093CFM/mcu.h
/* =========================================================  TCR0  ========================================================== */
/* =========================================================  TMR0  ========================================================== */
 #define R_TAU_TMR0_OPIRQ_Pos           (0UL)      /*!< OPIRQ (Bit 0)                                         */
 #define R_TAU_TMR0_OPIRQ_Msk           (0x1UL)    /*!< OPIRQ (Bitfield-Mask: 0x01)                           */
 #define R_TAU_TMR0_MD_Pos              (1UL)      /*!< MD (Bit 1)                                            */
 #define R_TAU_TMR0_MD_Msk              (0xeUL)    /*!< MD (Bitfield-Mask: 0x07)                              */
 #define R_TAU_TMR0_CIS_Pos             (6UL)      /*!< CIS (Bit 6)                                           */
 #define R_TAU_TMR0_CIS_Msk             (0xc0UL)   /*!< CIS (Bitfield-Mask: 0x03)                             */
 #define R_TAU_TMR0_STS_Pos             (8UL)      /*!< STS (Bit 8)                                           */
 #define R_TAU_TMR0_STS_Msk             (0x700UL)  /*!< STS (Bitfield-Mask: 0x07)                             */
 #define R_TAU_TMR0_MASTER_SPLIT_Pos    (11UL)     /*!< MASTER_SPLIT (Bit 11)                                 */
 #define R_TAU_TMR0_MASTER_SPLIT_Msk    (0x800UL)  /*!< MASTER_SPLIT (Bitfield-Mask: 0x01)                    */
 #define R_TAU_TMR0_CCS_Pos             (12UL)     /*!< CCS (Bit 12)                                          */
 #define R_TAU_TMR0_CCS_Msk             (0x1000UL) /*!< CCS (Bitfield-Mask: 0x01)                             */
 #define R_TAU_TMR0_CKS_Pos             (14UL)     /*!< CKS (Bit 14)                                          */
 #define R_TAU_TMR0_CKS_Msk             (0xc000UL) /*!< CKS (Bitfield-Mask: 0x03)                             */
/* =========================================================  TSR0  ========================================================== */
 #define R_TAU_TSR0_OVF_Pos             (0UL)      /*!< OVF (Bit 0)                                           */
 #define R_TAU_TSR0_OVF_Msk             (0x1UL)    /*!< OVF (Bitfield-Mask: 0x01)                             */
/* ==========================================================  TE0  ========================================================== */
 #define R_TAU_TE0_TE_Pos               (0UL)      /*!< TE (Bit 0)                                            */
 #define R_TAU_TE0_TE_Msk               (0xffUL)   /*!< TE (Bitfield-Mask: 0xff)                              */
 #define R_TAU_TE0_TEH1_Pos             (9UL)      /*!< TEH1 (Bit 9)                                          */
 #define R_TAU_TE0_TEH1_Msk             (0x200UL)  /*!< TEH1 (Bitfield-Mask: 0x01)                            */
 #define R_TAU_TE0_TEH3_Pos             (11UL)     /*!< TEH3 (Bit 11)                                         */
 #define R_TAU_TE0_TEH3_Msk             (0x800UL)  /*!< TEH3 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  TS0  ========================================================== */
 #define R_TAU_TS0_TS_Pos               (0UL)      /*!< TS (Bit 0)                                            */
 #define R_TAU_TS0_TS_Msk               (0xffUL)   /*!< TS (Bitfield-Mask: 0xff)                              */
 #define R_TAU_TS0_TSH1_Pos             (9UL)      /*!< TSH1 (Bit 9)                                          */
 #define R_TAU_TS0_TSH1_Msk             (0x200UL)  /*!< TSH1 (Bitfield-Mask: 0x01)                            */
 #define R_TAU_TS0_TSH3_Pos             (11UL)     /*!< TSH3 (Bit 11)                                         */
 #define R_TAU_TS0_TSH3_Msk             (0x800UL)  /*!< TSH3 (Bitfield-Mask: 0x01)                            */
/* ==========================================================  TT0  ========================================================== */
 #define R_TAU_TT0_TT_Pos               (0UL)      /*!< TT (Bit 0)                                            */
 #define R_TAU_TT0_TT_Msk               (0xffUL)   /*!< TT (Bitfield-Mask: 0xff)                              */
 #define R_TAU_TT0_TTH1_Pos             (9UL)      /*!< TTH1 (Bit 9)                                          */
 #define R_TAU_TT0_TTH1_Msk             (0x200UL)  /*!< TTH1 (Bitfield-Mask: 0x01)                            */
 #define R_TAU_TT0_TTH3_Pos             (11UL)     /*!< TTH3 (Bit 11)                                         */
 #define R_TAU_TT0_TTH3_Msk             (0x800UL)  /*!< TTH3 (Bitfield-Mask: 0x01)                            */
/* =========================================================  TPS0  ========================================================== */
 #define R_TAU_TPS0_PRS0_Pos            (0UL)      /*!< PRS0 (Bit 0)                                          */
 #define R_TAU_TPS0_PRS0_Msk            (0xfUL)    /*!< PRS0 (Bitfield-Mask: 0x0f)                            */
 #define R_TAU_TPS0_PRS1_Pos            (4UL)      /*!< PRS1 (Bit 4)                                          */
 #define R_TAU_TPS0_PRS1_Msk            (0xf0UL)   /*!< PRS1 (Bitfield-Mask: 0x0f)                            */
 #define R_TAU_TPS0_PRS2_Pos            (8UL)      /*!< PRS2 (Bit 8)                                          */
 #define R_TAU_TPS0_PRS2_Msk            (0x300UL)  /*!< PRS2 (Bitfield-Mask: 0x03)                            */
 #define R_TAU_TPS0_PRS3_Pos            (12UL)     /*!< PRS3 (Bit 12)                                         */
 #define R_TAU_TPS0_PRS3_Msk            (0x3000UL) /*!< PRS3 (Bitfield-Mask: 0x03)                            */
/* ==========================================================  TO0  ========================================================== */
 #define R_TAU_TO0_TO_Pos               (0UL)      /*!< TO (Bit 0)                                            */
 #define R_TAU_TO0_TO_Msk               (0xffUL)   /*!< TO (Bitfield-Mask: 0xff)                              */
/* =========================================================  TOE0  ========================================================== */
 #define R_TAU_TOE0_TOE_Pos             (0UL)      /*!< TOE (Bit 0)                                           */
 #define R_TAU_TOE0_TOE_Msk             (0xffUL)   /*!< TOE (Bitfield-Mask: 0xff)                             */
/* =========================================================  TOL0  ========================================================== */
 #define R_TAU_TOL0_TOL_Pos             (1UL)      /*!< TOL (Bit 1)                                           */
 #define R_TAU_TOL0_TOL_Msk             (0xfeUL)   /*!< TOL (Bitfield-Mask: 0x7f)                             */
/* =========================================================  TOM0  ========================================================== */
 #define R_TAU_TOM0_TOM_Pos             (1UL)      /*!< TOM (Bit 1)                                           */
 #define R_TAU_TOM0_TOM_Msk             (0xfeUL)   /*!< TOM (Bitfield-Mask: 0x7f)                             */

/* =========================================================================================================================== */
/* ================                                           R_TML                                           ================ */
/* =========================================================================================================================== */

